{
  "es": {
    "translate": {
      "current": "es",
      "to": "en"
    },
    "position": "Desarrollador (Web || JavaScript)",
    "goals": "Soy un programador con +<script type=\"text/javascript\">document.write(Math.floor((new Date() - new Date('06-01-2016') )/ (1000 * 60 * 60 * 24 * 365)))</script> años de experiencia. Comencé mi carrera profesional especializándome en frontend y es el ámbito que me apasiona. Pero en mi evolución busco la versatilidad y por eso amplío mis conocimientos trabajando como fullstack diariamente participando en las decisiones y soluciones de todo el proceso de desarrollo. Me considero resolutivo, autónomo y proactivo a la vez que jugador de equipo y colaborador. A lo largo de este tiempo he tenido la suerte de rodearme de los mejores gracias a lo cual he podido desarrollarme constantemente no sólo en la oficina si no fuera de ella con algún proyecto personal siempre entre manos.",
    "education": {
      "title": "Educación",
      "degree": "Ingeniería Industrial Electrónica",
      "location": "Univ. Castilla la Mancha",
      "date": "2015"
    },
    "languages": {
      "title": "Idiomas",
      "list": [
        {
          "item": "Español",
          "level": "Nativo"
        },
        {
          "item": "Inglés",
          "level": "B2, Cambridge First (FCE)"
        }
      ]
    },
    "skills": {
      "title": "Habilidades",
      "pro": {
        "title": "Técnicas",
        "list": [
          {
            "item": "Javascript/Typescript/Node"
          },
          {
            "item": "React/Angular"
          },
          {
            "item": "HTML/CSS/SCSS"
          },
          {
            "item": "REST/GraphQL"
          },
          {
            "item": "MongoDB/SQL"
          },
          {
            "item": "Git"
          }
        ]
      },
      "complementary": {
        "title": "Soft",
        "list": [
          { "item": "Metodologías ágiles" },
          { "item": "Trabajo en equipo" }
        ]
      }
    },
    "experiences": {
      "title": "Experiencia",
      "list": [
        {
          "title": "Desarrollador fullstack en <a href=\"https://www.lansweeper.com/\" target=\"_new\">Lansweeper</a>",
          "date": "Julio 2019 - Actualidad",
          "text": "En esta aventura formo parte del equipo encargado de crear una solución cloud SaaS para la gestión de inventario en el mundo IT. El software es desarrollado con React para el front; microservicios en node para los diferentes backends; graphQL, gRPC y kafka para las communicaciones y kubernetes para la infraestructura. Todo ello con CI/CD, github y tests. En esta etapa me encuentro con retos nuevos como orientar todo el desarrollo al rendimiento y la escalabilidad, realizar pruebas de concepto de forma muy ágil y trabajar y comunicarme con equipos alrededor de todo el mundo."
        },
        {
          "title": "Desarrollador fullstack en <a href=\"http://www.everis.com/global/en-US/home/Paginas/home.aspx\" target=\"_new\">Everis</a>",
          "date": "Julio 2016 - Julio 2019",
          "text": "He trabajado tanto para clientes externos como en proyectos internos, en los cuales he usado jQuery, Angular, Java, Spring, arquitecturas REST, MySQL, MongoDB, git y suite Atlassian entre otros. <ul><li>Promocioné de categoría en menos de un año mientras trabajaba en un proyecto para una aseguradora nacional.</li><li>Estuve en contacto directo y continuo con el cliente y adaptando los cambios y necesidades al desarrollo.</li><li>Gestioné varios servicios y herramientas internas usadas por la compañía en todo el mundo dando soporte, resolviendo incidencias y haciendo desarrollos nuevos.</li><li>Me desarrollé como formador acogiendo a compañeros nuevos e impartiendo charlas y cursos al resto de empleados en nuevas tecnologías.</li></ul>"
        }
      ]
    },
    "volunteering": {
      "title": "Voluntariado",
      "list": [
        {
          "title": "Voluntario en <a href=\"http://www.everis.com/global/en-US/home/Paginas/home.aspx\" target=\"_new\">Everis</a>",
          "date": "Junio 2016 - Julio 2019",
          "text": "He sido integrante de la organización en Alicante de varios eventos como son <a href=\"https://www.womentechmakers.com/\" target=\"_new\">Women Tech Makers</a> o <a href=\"https://hashcode.withgoogle.com/\" target=\"_new\">Hash Code</a>, ambos ideados por Google o <a href=\"https://2018.spaceappschallenge.org/\" target=\"_new\">Space Apps Challenge</a> convocado por la NASA. Todos ellos siendo éxitos de asistencia y organización. A su vez trabajé en proyectos personales y con otros compañeros, desarrollando ideas propias y  aplicando otras tecnologías ajenas a nuestro día a día con el fin de aprender y descubrir, todas ellas enfocadas al desarrollo web."
        },
        {
          "title": "<a href=\"http://qubic.es\" target=\"_new\">Qubic</a>",
          "date": "2012 - 2017",
          "text": "Miembro senior de una asociación de estudiantes dedicada a impartir exposiciones técnicas, organizar eventos en universidades de España y realizar proyectos de ingeniería."
        }
      ]
    }
  },
  "en": {
    "translate": {
       "current": "en",
      "to": "es"
    },
    "position": "(Web || JavaScript) Developer",
    "goals": "I am a +<script type=\"text/javascript\">document.write(Math.floor((new Date() - new Date('06-01-2016') )/ (1000 * 60 * 60 * 24 * 365)))</script> years of experience developer. I started my professional career specialized in fronted and that is the realm that I am passionate about.But trying to be more versatile, I am evolving widen my knowledge working as a fullstack developer daily taking part in the decision process and searching for solutions in the whole development process. I consider myself an autonomous, problem solver and proactive person while also being a team player and collaborative. All along this time I have been lucky enough to be surrounded by great people from whom I have learned a lot and developed my skills not only in the workplace but also with some side projects.",

    "education": {
      "title": "Education",
      "degree": "Electronics Engineering",
      "location": "University of Castilla La Mancha",
      "date": "2015"
    },
    "languages": {
      "title": "Languages",
      "list": [
        {
          "item": "Spanish",
          "level": "Native"
        },
        {
          "item": "English",
          "level": "B2, Cambridge First (FCE)"
        }
      ]
    },
    "skills": {
      "title": "Skills",
      "pro": {
        "title": "Technical",
        "list": [
          {
            "item": "Javascript/Typescript/Node"
          },
          {
            "item": "React/Angular"
          },
          {
            "item": "HTML/CSS"
          },
          {
            "item": "REST/GraphQL"
          },
          {
            "item": "MongoDB/SQL"
          }
        ]
      },
      "complementary": {
        "title": "Soft",
        "list": [{ "item": "Agile methodologies" }, { "item": "Teamwork" }]
      }
    },
    "experiences": {
      "title": "Experience",
      "list": [
        {
          "title": "Fullstack developer at <a href=\"https://www.lansweeper.com/\" target=\"_new\">Lansweeper</a>",
          "date": "July 2019 - Nowadays",
          "text": "In this adventure I take part in the team in charge of creating an IT assets management SaaS solution. This software is developed with React on the front; node microservices on the backends; graphQL, gRPC and kafka for communication and kubernetes for infraestructure. All of this stick together with CI/CD on github and tests. In this position I find new challenges everyday like focusing on performance and scalability when coding, creating POCs quickly and working with distributed teams across the globe."
        },
        {
          "title": "Fullstack developer at <a href=\"http://www.everis.com/global/en-US/home/Paginas/home.aspx\" target=\"_new\">Everis</a>",
          "date": "Juny 2016 - July 2019",
          "text": "I have worked on several projects, both for external clients and internal tools, in which I have used jQuery, Angular, Java, Spring, REST architectures, MySQL, MongoDB, git and Atlassian suite among others. <ul><li>I promoted in less than a year while working for a national insurance company.</li><li>I was in constant communication with the client and adapting our solution to their needs.</li><li>I managed several services and tools used across the whole company all around the world, I supported users, solved tickets and developed new features.</li><li>I grew up as a mentor helping new colleagues and giving talks and workshops to the rest of the employees in the center about rising technologies.</li></ul>"
        }
      ]
    },
    "volunteering": {
      "title": "Volunteering",
      "list": [
        {
          "title": "Volunteering at <a href=\"http://www.everis.com/global/en-US/home/Paginas/home.aspx\" target=\"_new\">Everis</a>",
          "date": "July 2016 - July 2019",
          "text": "I have been an altruistic member of the organization in Alicante of several events such as <a href=\"https://www.womentechmakers.com/\" target=\"_new\">Women Tech Makers</a> or <a href=\"https://hashcode.withgoogle.com/\" target=\"_new\">Hash Code</a>, both planned by Google or <a href=\"https://2018.spaceappschallenge.org/\" target=\"_new\">Space Apps Challenge</a> convoked by NASA. At the same time I work on side projects, personal and with other colleagues, exploring other technologies such as Amazon Web Services or Docker."
        },
        {
          "title": "<a href=\"http://qubic.es\" target=\"_new\">Qubic</a>",
          "date": "2012 - 2017",
          "text": "Senior member of this student assosiaction dedicated to organize workshops and technical expositions, organize events in spanish univeersities and build engineering projects."
        }
      ]
    }
  }
}
